garyPenhook/PyAvrOCD/svd/atmega808.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CCL</name>
      <description>Configurable Custom Logic</description>
      <baseAddress>0x008001C0</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x3</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x5</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x7</offset>
        <size>0x11</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control Register A</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCTRL0</name>
          <description>Interrupt Control 0</description>
          <addressOffset>0x5</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INTMODE0</name>
              <description>Interrupt Mode for LUT0</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTDISABLE</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Sense rising edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Sense falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Sense both edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTMODE1</name>
              <description>Interrupt Mode for LUT1</description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTDISABLE</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Sense rising edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Sense falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Sense both edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTMODE2</name>
              <description>Interrupt Mode for LUT2</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTDISABLE</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Sense rising edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Sense falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Sense both edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INTMODE3</name>
              <description>Interrupt Mode for LUT3</description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INTDISABLE</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Sense rising edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Sense falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Sense both edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAGS</name>
          <description>Interrupt Flags</description>
          <addressOffset>0x7</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INT</name>
              <description>Interrupt Flags</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT0CTRLA</name>
          <description>LUT Control 0 A</description>
          <addressOffset>0x8</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>LUT Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLKSRC</name>
              <description>Clock Source Selection</description>
              <bitRange>[3:1]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLKPER</name>
                  <description>CLK_PER is clocking the LUT</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IN2</name>
                  <description>IN[2] is clocking the LUT</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSC20M</name>
                  <description>20MHz oscillator before prescaler is clocking the LUT</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCULP32K</name>
                  <description>32kHz oscillator is clocking the LUT</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCULP1K</name>
                  <description>1kHz (32kHz oscillator after DIV32) is clocking the LUT</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FILTSEL</name>
              <description>Filter Selection</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Filter disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCH</name>
                  <description>Synchronizer enabled</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FILTER</name>
                  <description>Filter enabled</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTEN</name>
              <description>Output Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGEDET</name>
              <description>Edge Detection Enable</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Edge detector is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Edge detector is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT0CTRLB</name>
          <description>LUT Control 0 B</description>
          <addressOffset>0x9</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INSEL0</name>
              <description>LUT Input 0 Source Selection</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Masked input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEEDBACK</name>
                  <description>Feedback input source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINK</name>
                  <description>Linked LUT input source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENTA</name>
                  <description>Event input source A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENTB</name>
                  <description>Event input source B</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO</name>
                  <description>IO pin LUTn-IN0 input source</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0</name>
                  <description>AC0 OUT input source</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART0</name>
                  <description>USART0 TXD input source</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0</name>
                  <description>SPI0 MOSI input source</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0</name>
                  <description>TCA0 WO0 input source</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB0</name>
                  <description>TCB0 WO input source</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>INSEL1</name>
              <description>LUT Input 1 Source Selection</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Masked input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEEDBACK</name>
                  <description>Feedback input source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINK</name>
                  <description>Linked LUT input source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENTA</name>
                  <description>Event input source A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENTB</name>
                  <description>Event input source B</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO</name>
                  <description>IO pin LUTn-N1 input source</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0</name>
                  <description>AC0 OUT input source</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART1</name>
                  <description>USART1 TXD input source</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0</name>
                  <description>SPI0 MOSI input source</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0</name>
                  <description>TCA0 WO1 input source</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB1</name>
                  <description>TCB1 WO input source</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LUT0CTRLC</name>
          <description>LUT Control 0 C</description>
          <addressOffset>0xA</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>INSEL2</name>
              <description>LUT Input 2 Source Selection</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MASK</name>
                  <description>Masked input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FEEDBACK</name>
                  <description>Feedback input source</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LINK</name>
                  <description>Linked LUT input source</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENTA</name>
                  <description>Event input source A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EVENTB</name>
                  <description>Event input source B</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO</name>
                  <description>IO pin LUTn-IN2 input source</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AC0</name>
                  <description>AC0 OUT input source</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USART2</name>
                  <description>USART2 TXD input source</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPI0</name>
                  <description>SPI0 SCK input source</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCA0</name>
                  <description>TCA0 WO2 input source</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TCB2</name>
                  <description>TCB2 WO input source</description>
                  <value>12</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
